cases/closedBox/wedge/0.org/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    outlet
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    walls
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    top
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    front
    {
        type        wedge;
    }

    back
    {
        type        wedge;
    }

    axis
    {
        type        symmetry;
    }
}
