cases/closedBox/wedge/0.org/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type        nutkWallFunction;
        value       $internalField;
    }

    outlet
    {
        type        nutkWallFunction;
        value       $internalField;
    }

    walls
    {
        type        nutkWallFunction;
        value       $internalField;
    }

    top
    {
        type        nutkWallFunction;
        value       $internalField;
    }

    front
    {
        type        wedge;
    }

    back
    {
        type        wedge;
    }

    axis
    {
        type        symmetry;
    }
}
